# Для работы в git используются следующие команды:

* *git __version__* - показывает, какая версия git устанолена на компьбтере;

* *git __status__* - показывает текущее состояние репозитория, а также несохраненные изменения при работе с файлами;

* *git __init__* - запоминаем каталог для работы;

* *git __add__ file_name* - добавление файла file_name в память git. Имя файла указывать с расширением;

* *git __commit__ -a (-m) "..."* - сохраняет текущую версию файла, в кавычках указывается комментарий;

* *git __diff__* - показывает различия между последней сохранённой версией файла и текущей версией файла;

* *git __log__* - статистика изменений, произведённых в файле;

* *git __checkout__ name* - переход к коммиту файла (name - имя из логов) или к ветке (name - имя ветки);

* *git __branch__* - вывод перечня существующих веток. Символом "*" при этом указана текущая ветка;

* *git __branch__ new_branch* - создание новой ветки с именем new_branch;

* *git __branch -d__ branch_name* - удаление ветки branch_name;

* *git __log --graph__* - вывод существующих коммитов в графическом виде;

* *git __merge__ branch_name* - слияние веток, изменения из ветки branch_name вносятся в текущую ветку;

* *git __remote__ add origin web-link* - добавляет ссылку на удаленный репозиторий (web-link) в git;

* *git __clone__* - копирование удаленного репозитория в локальный;

* *git __pull__* - скачивается все актуальное содержимое из удаленного репозитория, при этом скачанное содержимое сливается с содержимым локального репозитория;

* *git __push__* - выгрузка локального репозитория на web-сервер (необходима авторизация в удаленном репозитории);

* *git __branch__ -M main* - указывает,какая ветка является главной в удаленном репозитории;

* *git __push__* *-u origin main* - из локального репозитория загружается содержимое в ветку main удаленного репозитория (необходима авторизация в удаленном репозитории)

##Дополнительные команды

  * *cd __link_catalog__* - переход в папку link_catalog;

  * *echo __new_text__ > __file_name__* - создание в текущем репозитории нового файла "file_name" с содержимым "new_text";

  * *__clear__* - очистка содержимого терминала
